if __name__ == '__main__':
    operators_text = r'''结合性    优先级    运算符             描述                          
从左到右     
            1         ++              后置自增                         
                      --              后置自减
                      ()              转变优先级、函数调用
                      []              数组下标
                      .               结构体和联合体成员访问
                      ->              通过指针访问结构体和联合体成员
                      (type){list}    复合字面量（C99引入）
从右到左     
            2         ++              前置自增                         
                      --              前置自减
                      +               正号（一元加）
                      -               负号（一元减）
                      !               逻辑非
                      ~               按位取反
                      (type)          类型转换                                  
                      *               间接寻址（解引用）                                  
                      &               取地址                                  
                      sizeof          获取数据类型的大小
                      _Alignof        对齐要求（C11引入）
从左到右
            3         *               乘法                             
                      /               除法
                      %               取模                                  
            4         +               加法                                  
                      -               减法                                  
            5         <<              左移                                  
                      >>              右移                                  
            6         <               小于                                  
                      <=              小于等于                                  
                      >               大于                                  
                      >=              大于等于                                  
            7         ==              相等                                  
                      !=              不等于                                  
            8         &               按位与                                  
            9         ^               按位异或                                  
            10        |               按位或                                  
            11        &&              逻辑与                                  
            12        ||              逻辑或                                  
从右到左
            13        ?:              三目运算符                      
            14        =               赋值                                  
                      +=              加赋值                                  
                      -=              减赋值                                  
                      *=              乘赋值                                  
                      /=              商赋值                                  
                      %=              余数赋值                                  
                      <<=             左移赋值                                  
                      >>=             右移赋值                                  
                      &=              按位与赋值                                  
                      ^=              按位异或赋值                                  
                      |=              按位或赋值                                  
从左到右
            15        ,               逗号运算符'''
    text_rows = operators_text.split('\n')
    print("========================================== C OPERATORS ==========================================")

    for i in text_rows:
        line_split = i.split()

        if len(line_split) == 1:
            print('\033[31m' + line_split[0] + '\033[0m')
        elif len(line_split) == 2:
            print(" " * (42) + '\033[32m' + line_split[0] + '\033[0m' 
                  + " " * (20 - len(line_split[0])) + '\033[33m' + line_split[1] + '\033[0m')
        elif len(line_split) == 3:
            print(" " * (22) + '\033[34m' + line_split[0] + '\033[0m' 
                  + '\033[32m' + " " * (20 - len(line_split[0])) + line_split[1] + '\033[0m' 
                  + '\033[33m' + " " * (20 - len(line_split[1])) + line_split[2] + '\033[0m')
        else:
            print('\033[31m' + line_split[0] + " " * 10 + '\033[0m' 
                  + '\033[34m' + " " * 4 + line_split[1] + " " * 4 + '\033[0m' 
                  + '\033[32m' + " " * 10 + line_split[2] + " " * 2 + '\033[0m' 
                  + '\033[33m' + " " * 16 + line_split[3] + '\033[0m')
    
    print("=================================================================================================")
    print('\033[32m' + "参考资料：\nhttps://cppreference.cn/w/c/language/operator_precedence" + '\033[0m')